config.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Startup Preformance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

Also, turn on lexical-binding for the init file!

*Packages:*
- [[https://github.com/emacsmirror/gcmh][emacsmirror/gcmh]]

#+begin_src emacs-lisp

; -*- lexical-binding: t; -*-

;; The default is 800 kilobytes. Measured in bytes.
;; If you experience freezing, decrease this.
;; If you experience stuttering, increase this."
(setq gc-cons-threshold (* 134217728)) ; 128mb

(use-package gcmh
  :init (gcmh-mode 1)
  :config
  (setq gcmh-idle-delay 'auto ; default is 15s
        gcmh-auto-idle-delay-factor 10
        gcmh-high-cons-threshold (* 16 1024 1024))) ; 16mb

;; Profile emacs startup
;(add-hook 'emacs-startup-hook
;          (lambda ()
;            (message "*** Eamcs loaded in %s with %d gargabe collections."
;                     (format "%.2f seconds"
;                             (float-time
;                              (time-subtract after-init-time before-init-time)))
;                     gcs-done)))
#+end_src

* Package Managment
** Basic Setup

Set up ELPA, MELPA, and Org package repositories and load =use-package= to manage package configuration.

#+begin_src emacs-lisp

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

#+end_src

** Automatically Update Packages

Automatically prompt user to update packages (and then update them).

*Packages:*
- [[https://github.com/rranelli/auto-package-update.el][rranelli/auto-package-update.el]]

#+begin_src emacs-lisp

(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-result t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "17:30"))

#+end_src

** Keep Folders Clean

Change default path to store configuration files and peersistent data in a cleaner and more consistent way.

*Packages:*
- [[https://github.com/emacscollective/no-littering][emacscollective/no-littering]]

#+begin_src emacs-lisp

;; NOTE: If you want to move everything out of the ~/.emacs.d folder
;; reliably, set `user-emacs-directory` before loading no-littering!
;(setq user-emacs-directory "~/.cache/emacs")

(use-package no-littering)

;; no-littering doesn't set this by default so we must place
;; auto save files in the same path as it uses for sessions
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src
* Keybinding Configuration
** ESC Cancels All

#+begin_src emacs-lisp

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

** Evil

Setup Evil mode key bindings.

*Packages:*
- [[https://github.com/emacs-evil/evil][emacs-evil/evil]]
- [[https://github.com/emacs-evil/evil-collection][emacs-evil/evil-collection]]

#+begin_src emacs-lisp

(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-d-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-respect-visual-line-mode t)
  (setq evil-search-module 'evil-search) 
  (setq evil-undo-system 'undo-tree)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  ;(key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
  ;; split windows
  (define-key evil-normal-state-map (kbd "C-S-v") 'evil-window-vsplit)
  (define-key evil-normal-state-map (kbd "C-S-h") 'evil-window-split) 
  ;; move across splits
  (define-key evil-normal-state-map (kbd "C-h") 'evil-window-left)
  (define-key evil-normal-state-map (kbd "C-l") 'evil-window-right)
  (define-key evil-normal-state-map (kbd "C-k") 'evil-window-up)
  (define-key evil-normal-state-map (kbd "C-j") 'evil-window-down)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :config
  (evil-collection-init))

#+end_src

** General

General.el is a fantastic library for defining prefixed keybindings, especially in conjunction with Evil modes.

*Packages:*
[[https://github.com/noctuid/general.el][noctuid/general.el]]

#+begin_src emacs-lisp

(use-package general
  :after evil
  :config
  (general-evil-setup t)
  (general-auto-unbind-keys)
  (general-create-definer malachi/leader-keys
                          :keymaps '(normal visual emacs)
                          :prefix "SPC"
                          :global-prefix "C-SPC")
  (malachi/leader-keys
   "q" '(:ignore t :which-key "quit")
   "qq" '(kill-buffer-and-window :which-key "kill window & buffer")
   "qw" '(delete-window :which-key "delete window")
   "qb" '(kill-this-buffer :which-key "kill buffer")
   "w" '(save-buffer :which-key "save")
   "e" '(treemacs :which-key "treemacs")
   "v" '(vterm :which-key "vterm")
   "t" '(:ignore t :which-key "toggle")))

(general-define-key "C-M-j" 'counsel-switch-buffer)

#+end_src

** Key-chord

Key-chord is useful for setting 2-key keybinds that should be pressed simultaneously (and otherwise have different uses). Key-chord doesn't work well with changing input-methods (which my configuration uses), so for now it's not used.

*Packages:*
- [[https://github.com/emacsorphanage/key-chord][emacsorphanage/key-chord]]

#+begin_src emacs-lisp

(use-package key-chord
  :init
  (setq key-chord-two-keys-delay 0.1)
  (setq key-chord-one-key-delay 0.2)
  :config
  (key-chord-mode 1))

#+end_src

** Which-key

Which-key is great for getting an overview of what keybindings are avialable based on the prefix keys you entered.

*Packages:*
- [[https://github.com/justbur/emacs-which-key][justbur/emacs-which-key]]

#+begin_src emacs-lisp

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-popup-type 'minibuffer)
  (setq which-key-idle-delay 0.5
        which-key-add-column-padding 1
        which-key-separator "  "
        which-key-prefix-prefix "+"
        which-key-unicode-correction 3
        which-key-show-prefix 'left))

#+end_src

** Hydra

Hydar is a package that can be used to tie related commands into a family of short stateful bindings with a common prefix. It has many useful configurations available for each "hydra".

*Packages:*
- [[https://github.com/abo-abo/hydra][abo-abo/hydra]]

#+begin_src emacs-lisp

(use-package hydra
  :defer t)

#+end_src

* UI Configuration
** Basic UI Configuration

Clean up Emacs' user interface, make it more minimal

#+begin_src emacs-lisp

(setq inhibit-startup-screen t) ; Disable default emacs startup screen

(scroll-bar-mode -1)         ; Disable visible scrollbar
(tool-bar-mode -1)           ; Disable the toolbar
(tooltip-mode -1)            ; Disable tooltips
(set-fringe-mode 10)         ; Give some breathig room

(menu-bar-mode -1)           ; Disable the menue bar

(setq visible-bell t) ;; Set up the visible bell

#+end_src

Improve scrolling

#+begin_src emacs-lisp

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
;(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
(setq scroll-step 1) ;; keyboard scroll one line at a time
(setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX
  
#+end_src

Enable line numbers and customize their format.

#+begin_src emacs-lisp

;; Line numbers
(column-number-mode)
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                treemacs-mode-hook
                neotree-mode-hook
                vterm-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda() (display-line-numbers-mode 0))))

#+end_src

Disable line wrapping by default

#+begin_src emacs-lisp

(setq-default truncate-lines t) ; Disable line wraping

#+end_src


Disable ugly bookmark fringe mark indicator 

#+begin_src emacs-lisp

(setq bookmark-set-fringe-mark nil)
;; TODO: Change to this symbol - 

#+end_src

Use y/n prompt instead of yes/no

#+begin_src emacs-lisp

(defalias 'yes-or-no-p 'y-or-n-p)

#+end_src

By default emacs will not delete selection text when typing on it, let's fix it.

#+begin_src emacs-lisp

(delete-selection-mode t)

#+end_src

Some misc better default settings

#+begin_src emacs-lisp

(setq-default
  cursor-in-non-selected-windows nil ; Hide the cursor in inactive windows.
  default-directory "~/"
  tab-width 4
  indent-tabs-mode nil              ; set indentation with spaces instead of tabs with 4 spaces.
  indent-line-function 'insert-tab)

#+end_src

Don't warn for large files (shows up when launching videos)

#+begin_src emacs-lisp

(setq large-file-warning-threshold nil)

#+end_src

Don't warn for following symlinked files

#+begin_src emacs-lisp

(setq vc-follow-symlinks t)

#+end_src

Don't warn when advice is added for functions

#+begin_src emacs-lisp

(setq ad-redefinition-action 'accept)

#+end_src

** Font
