config.org
*** Basic  Configuration

Set basic font settings (unicode encoding, font-lock, font size...)

#+begin_src emacs-lisp

;; default to utf-8 for all the things
(set-charset-priority 'unicode)
(setq locale-coding-system 'utf-8
      coding-system-for-read 'utf-8
      coding-system-for-write 'utf-8)
(prefer-coding-system 'utf-8)
(set-language-environment 'utf-8)
(setq locale-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-selection-coding-system 'utf-8)
(set-clipboard-coding-system 'utf-8)
(set-locale-environment "en_US.UTF-8")
(set-buffer-file-coding-system 'utf-8-unix)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))

(global-font-lock-mode 1)             ; Use font-lock everywhere.
(setq font-lock-maximum-decoration t) ; We have CPU to spare; highlight all syntax categories.

;; Font size
(defvar malachi/default-font-size 100)
(defvar malachi/default-variable-font-size 120)

#+end_src

*** Set Fonts

Set the font faces for each pitch, and make sure fonts are loaded correctly when useing daemon mode.

#+begin_src emacs-lisp

(defun malachi/set-font-faces ()
  (set-face-attribute 'default nil :font "FiraCode NF" :height malachi/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "FiraCode NF" :height malachi/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height malachi/default-variable-font-size :weight 'regular))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)
                (setq dashboard-set-file-icons t)
                (with-selected-frame frame
                  (malachi/set-font-faces))))
    (malachi/set-font-faces))

#+end_src

*** Ligatures

Enable ligatures (currrently configured for FiraCode font)

*Packages:*
- [[https://github.com/mickeynp/ligature.el][mickeynp/ligature.el]]

#+begin_src emacs-lisp

  (use-package ligature
    :config
    ;; Enable www ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the `variable-pitch` face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable ligatures in programming modes
    (ligature-set-ligatures '(prog-mode org-mode LaTeX-mode)
                            '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                              ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                               "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                               "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                               "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                               "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                               "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                               "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                               "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                               "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
    ;; Enables ligature checks globally in all buffers.
    ;; You can aslo do per mode with `ligature-mode1
    (global-ligature-mode 't))

#+end_src

*** Hebrew Support

Better support for Bidirectional text, hebrew, and input switching.

Using [[https://github.com/doomemacs/doomemacs/blob/master/modules/input/bidi/config.el][code from Doom Emacs bidi module]].

#+begin_src emacs-lisp

;; Doom Emacs Code
(defvar +bidi-mode-map (make-sparse-keymap)
  "Keymap for `+bidi-mode'.")

(defvar +bidi-hebrew-font (font-spec :family "Heebo" :weight 'light)
  "Overriding font for hebrew script.
   Must be a `font-spec', see `doom-font' for examples.
   WARNING: if you specify a size for this font it will hard-lock any usage of this
   font to that size. It's rarely a good idea to do so!")

(defface +bidi-hebrew-face `((t :font ,+bidi-hebrew-font)) "")

(defcustom +bidi-want-smart-fontify t
  "Use bidi override fonts on surrounding space and punctuation as well.
   Add `+bidi-smart-fontify-keywords' to `font-lock-keywords' on editable buffers
   when `+bidi-mode' is on."
  :type 'boolean)

(defvar +bidi-smart-fontify-keywords
  `((,(rx (any (#x0590 . #x05FF))       ; Hebrew
          (group (one-or-more (any " " punctuation))))
     (1 '+bidi-hebrew-face t)))

  "`font-lock' keywords matching spaces and punctuation after RTL characters.
   See the variable `font-lock-keywords' for information on the format.")

(defcustom +bidi-paragraph-direction nil
  "The value of `bidi-paragragh-direction' when `+bidi-mode' is on.
   See the `bidi-paragraph-direction' for more info.
   Warning: do not change this if you are using `+bidi-global-mode'.'"
  :type '(choice
          (const :tag "Left to Right" left-to-right)
          (const :tag "Right to Left" right-to-left)
          (const :tag "Dynamic, according to paragraph text" nil)))

   ;;;###autoload
(define-minor-mode +bidi-mode
  "Minor mode for using bidirectional text in a buffer.
   Note that the whole buffer doesn't have to contain any
   bidirectional text at all, this mode just makes bidi editing
   easier."
  :keymap +bidi-mode-map
  (if +bidi-mode
      (progn
        (setq bidi-paragraph-direction +bidi-paragraph-direction   ; Better paragraph alignment
              bidi-paragraph-separate-re "^" ; No need for empty lines to switch alignment
              bidi-paragraph-start-re "^"    ; ^
              bidi-inhibit-bpa nil)          ; Better bidi paren logic
        (when (and +bidi-want-smart-fontify
                   (not buffer-read-only))
          (font-lock-add-keywords
           nil
           +bidi-smart-fontify-keywords
           'append)
          (font-lock-flush)))
    (setq bidi-paragraph-direction 'left-to-right
          bidi-paragraph-separate-re nil
          bidi-paragraph-start-re nil
          bidi-inhibit-bpa t)
    (when (and +bidi-want-smart-fontify
               (not buffer-read-only))
      (font-lock-remove-keywords
       nil
       +bidi-smart-fontify-keywords)
      (font-lock-flush))))

(define-globalized-minor-mode +bidi-global-mode +bidi-mode +bidi-mode)

(defun +bidi-set-fonts-h ()
  (set-fontset-font t 'hebrew +bidi-hebrew-font)
  (set-face-font '+bidi-hebrew-face +bidi-hebrew-font))

(add-hook 'after-setting-font-hook
  (+bidi-set-fonts-h))

;; My Configuration Choice
(set-input-method 'rfc1345) ; Default
(setq-default +bidi-hebrew-font (font-spec :family "Heebo" :weight 'light)
(+bidi-set-fonts-h)
(+bidi-global-mode 1)
;(set-fontset-font "fontset-default" 'hebrew (font-spec :family "Heebo"))

(defhydra hydra-toggle-language (:timeout 4)
  "toggle input language"
  ("h" (set-input-method 'hebrew-full) "Hebrew" :exit t)
  ("e" (set-input-method 'rfc1345) "English" :exit t))

(malachi/leader-keys
  "tl" '(hydra-toggle-language/body :which-key "toggle language"))

#+end_src

*** Enable Proper Unicode Glypgh Support

*Packages:*
- [[https://github.com/rolandwalker/unicode-fonts][roland/walker/unicode-fonts]]

#+begin_src emacs-lisp

(defun malachi/replace-unicode-font-mapping (block-name old-font new-font)
  (let* ((block-idx (cl-position-if
                         (lambda (i) (string-equal (car i) block-name))
                         unicode-fonts-block-font-mapping))
         (block-fonts (cadr (nth block-idx unicode-fonts-block-font-mapping)))
         (updated-block (cl-substitute new-font old-font block-fonts :test 'string-equal)))
    (setf (cdr (nth block-idx unicode-fonts-block-font-mapping))
          `(,updated-block))))

(use-package unicode-fonts
  :custom
  (unicode-fonts-skip-font-groups '(low-quality-glyphs))
  :config
  ;; Fix the font mappings to use the right emoji font
  (mapcar
    (lambda (block-name)
      (malachi/replace-unicode-font-mapping block-name "Apple Color Emoji" "Noto Color Emoji"))
    '("Dingbats"
      "Emoticons"
      "Miscellaneous Symbols and Pictographs"
      "Transport and Map Symbols"))
  (unicode-fonts-setup))

#+end_src

*** Emojis in Buffers

*Packages:*
- [[https://github.com/iqbalansari/emacs-emojify][iqbalansari/emacs-emojify]]
  
#+begin_src emacs-lisp

(use-package emojify
  :hook (erc-mode . emojify-mode)
  :commands emojify-mode)

#+end_src

