config.org
*** Text Scaling

Text scaling using a hydra

#+begin_src emacs-lisp

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(malachi/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

** Icons

NOTE: The first time you load your configuratiion on a new machine, you'll need to run the following comand interactively so that mode line icons display correctly:

=M-x all-the-icons-install-fonts=

*Packages:*
- [[https://github.com/domtronn/all-the-icons.el][domtronn/all-the-icons.el]]
- [[https://github.com/asok/all-the-icons-ivy][asok/all-the-icons-ivy[]]

#+begin_src emacs-lisp

(use-package all-the-icons)

(use-package all-the-icons-ivy
  :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup)
  :config
  (setq all-the-icons-ivy-file-commands '(counsel-find-file
					  counsel-file-jump
					  counsel-recentf
					  counsel-projectile-find-file
					  counsel-projectile-find-dir)))
#+end_src

** Theme

*Packages*:
[[https://github.com/doomemacs/themes][doomemacs/themes]]
[[https://github.com/hlissner/emacs-solaire-mode][hlissner/emacs-solaire-mode]]

#+begin_src emacs-lisp

(global-hl-line-mode t)

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
	  doom-themes-enable-italic t)
  (load-theme 'doom-ayu-dark t)
  ;(load-theme 'doom-tomorrow-night)
  (doom-themes-visual-bell-config)
  (doom-themes-neotree-config)
  (doom-themes-treemacs-config)
  (doom-themes-org-config)
  ;; Correct line number colors for ayu-dark
  (set-face-foreground 'line-number "#1e222a")
  (set-face-foreground 'line-number-current-line "#e6b673"))
  
(use-package solaire-mode
  :defer 0.1
  :custom (solaire-mode-remap-fringe t)
  :config (solaire-global-mode +1))
  
(malachi/leader-keys
 "tt" '(counsel-load-theme :which-key "choose theme"))

#+end_src

** Mode Line
*** Basic Configuration

#+begin_src emacs-lisp

(setq display-time-format "%k:%M %a %d/%m/%y"
      display-time-default-load-average nil)

#+end_src

*** Enable Mode Diminishing

The [[https://github.com/myrjola/diminish.el][diminish]] package hides pesky minor modes from the modelines.

#+begin_src emacs-lisp

(use-package diminish)

#+end_src

*** Doom Modeline

*Packages:*
- [[https://github.com/seagle0128/doom-modeline][seagle0128/doom-modeline]]
- [[https://github.com/tarsius/minions][tarsius/minions]]

#+begin_src emacs-lisp

(use-package minions
  :hook (doom-modeline-mode . minions-mode))

(use-package doom-modeline
  :hook (after-init . doom-modeline-init)
  :config (doom-modeline-mode)
  :custom
  (doom-modeline-icon t)
  (doom-modeline-height 15)
  (doom-modeline-bar-width 6)
  (doom-modeline-lsp t)
  (doom-modeline-github nil)
  (doom-modeline-mu4e nil)
  (doom-modeline-irc t)
  (doom-modeline-minor-modes t)
  (doom-modeline-persp-name nil)
  (doom-modeline-buffer-file-name-style 'truncate-except-project))
  ;(doom-modeline-major-mode-icon nil))

#+end_src

** Tab Bar

A nice tab bar for buffers. Tabs (buffers) are also grouped by category.

*Packages:*
- [[https://github.com/ema2159/centaur-tabs][ema2159/centaur-tabs]]

#+begin_src emacs-lisp

(defun centaur-tabs-buffer-groups ()
  "`centaur-tabs-buffer-groups' control buffers' group rules.

  Group centaur-tabs with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' ired-mode' `org-mode' `magit-mode'.
    All buffer name start with * will group to \"Emacs\".
    Other buffer group by `centaur-tabs-get-group-name' with project name."
  (list
   (cond
    ((or (string-equal "*" (substring (buffer-name) 0 1))
         (memq major-mode '(magit-process-mode
                            magit-status-mode
                            magit-diff-mode
                            magit-log-mode
                            magit-file-mode
                            magit-blob-mode
                            magit-blame-mode
                            )))
     "Emacs")
    ((derived-mode-p 'prog-mode)
     "Editing")
    ((derived-mode-p 'dired-mode)
     "Dired")
    ((memq major-mode '(helpful-mode
                        help-mode))
     "Help")
    ((memq major-mode '(org-mode
                        org-agenda-clockreport-mode
                        org-src-mode
                        org-agenda-mode
                        org-beamer-mode
                        org-indent-mode
                        org-bullets-mode
                        org-cdlatex-mode
                        org-agenda-log-mode
                        diary-mode))
     "OrgMode")
    (t
     (centaur-tabs-get-group-name (current-buffer))))))

(defun centaur-tabs-hide-tab (x)
  "Do no to show buffer X in tabs."
  (let ((name (format "%s" x)))
    (or
     ;; Current window is not dedicated window.
     (window-dedicated-p (selected-window))

     ;; Buffer name not match below blacklist.
     (string-prefix-p "*epc" name)
     (string-prefix-p "*helm" name)
     (string-prefix-p "*Helm" name)
     (string-prefix-p "*Compile-Log*" name)
     (string-prefix-p "*lsp" name)
     (string-prefix-p "*company" name)
     (string-prefix-p "*Flycheck" name)
     (string-prefix-p "*tramp" name)
     (string-prefix-p " *Mini" name)
     (string-prefix-p "*help" name)
     (string-prefix-p "*straight" name)
     (string-prefix-p " *temp" name)
     (string-prefix-p "*Help" name)
     (string-prefix-p "*mybuf" name)
     (string-prefix-p "*vterm*" name)
     (string-prefix-p "*terminal*" name)
     (string-prefix-p "*eshell*" name)

     ;; Is not magit buffer.
     (and (string-prefix-p "magit" name)
          (not (file-name-extension name)))
     )))
  
(use-package centaur-tabs
  :demand
  :hook
  (dired-mode . centaur-tabs-local-mode)
  (dashboard-mode . centaur-tabs-local-mode)
  (org-agenda-mode . centaur-tabs-local-mode)
  (calendar-mode . centaur-tabs-local-mode)
  :init
  (setq centaur-tabs-enable-key-bindings t)
  :config
  (setq centaur-tabs-style "wave"
        centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "●"
        centaur-tabs-set-icons t
        centaur-tabs-show-new-tab-button t)
  (centaur-tabs-mode t)
  :bind
  ("C-M-h" . centaur-tabs-backward)
  ("C-M-l" . centaur-tabs-forward)
  ("s-S-l" . centaur-tabs-move-current-tab-to-left)
  ("s-S-h" . centaur-tabs-move-current-tab-to-right)
  (:map evil-normal-state-map
    ("C-M-h" . centaur-tabs-backward)
    ("C-M-l" . centaur-tabs-forward)
    ("s-S-l" . centaur-tabs-move-current-tab-to-left)
    ("s-S-h" . centaur-tabs-move-current-tab-to-right)
    ("g t" . centaur-tabs-forward)
    ("g T" . centaur-tabs-backward)))

#+end_src

** Dashboard

A better startup page.

*Packages:*
- [[https://github.com/emacs-dashboard/emacs-dashboard][emacs-dashboard/emacs-dashboard]]

#+begin_src emacs-lisp

(use-package dashboard
  :after all-the-icons
  :config
  (setq dashboard-banner-logo-title "With Great Power Comes Great Responsibility!\n\n\n\n"
        dashboard-center-content t
        dashboard-set-footer nil 
        dashboard-startup-banner "~/.emacs.d/banner.txt"
        dashboard-show-shortcuts nil
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-projects-backend 'projectile
        dashboard-projects-switch-function 'counsel-projectile-switch-project-by-name
        dashboard-items '((recents . 10)
                          (bookmarks . 5)
                          (projects . 5)
                          (agenda . 5)))
  (dashboard-setup-startup-hook))

;; For frames created by emacsclient -c
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))

#+end_src

** Ivy and Counsel
*** Basic Configuration

[[https://github.com/abo-abo/swiper][abo-abo/swiper (Ivy/Counsel)]]
[[https://github.com/Yevgnen/ivy-rich][Yevgen/ivy-rich]]

#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
         :config
         (setq ivy-extra-directories nil)
         (ivy-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil)) ; Don't start searches with ^

#+end_src

