config.org
*** Improved Candidate Sorting

[[https://github.com/radian-software/prescient.el][radian-software/prescient.el]]
[[https://github.com/lewang/flx][lewang/flx]]

#+begin_src emacs-lisp

(use-package ivy-prescient ;; Remember history
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))

(use-package flx  ;; Improves sorting for fuzzy-matched results
  :after ivy
  :defer t
  :init
  (setq ivy-flx-limit 10000))

#+end_src

*** Posframe

[[https://github.com/tumashu/ivy-posframe]]

#+begin_src emacs-lisp

(use-package ivy-posframe
  :after ivy
  :custom
  (ivy-posframe-border-width 6)
  ;(ivy-posframe-width      200)
  (ivy-posframe-min-width  115)
  ;(ivy-posframe-height     10)
  (ivy-posframe-min-height 10)
  :config
  (setq ivy-posframe-display-functions-alist
        '((complete-symbol . ivy-posframe-display-at-point)
          (swiper . ivy-display-function-fallback)
          (swiper-isearch . ivy-display-function-fallback)
          (counsel-M-x . ivy-posframe-display-at-frame-top-center)
          (t . ivy-posframe-display-at-frame-top-center)))
  (setq ivy-posframe-parameters '((parent-frame . nil)
                                  (left-fringe . 8)
                                  (right-fringe . 8)))
  (ivy-posframe-mode t))

#+end_src

** Helpful

An alternative to the built-in Emacs help that provides much more contextual information.

*Packages:*
- [[https://github.com/Wilfred/helpful][Wilfred/helpful]]

#+begin_src emacs-lisp

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

#+end_src

** Page Break Lines

Provides a global mode which displays ugly form feed characters as tidy horizontal rules.

*Packages:*
- [[https://github.com/purcell/page-break-lines][pucell//page-break-lines]]

#+begin_src emacs-lisp

(use-package page-break-lines
  :config
  (global-page-break-lines-mode))

#+end_src

* Org Mode
** Basic Configuration

#+begin_src emacs-lisp

(defun malachi/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil)
  (prettify-symbols-mode)
  (setq prettify-symbols-unprettify-at-point 'right-edge)
  (diminish org-indent-mode))

(use-package org
  :defer t
  :hook (org-mode . malachi/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-startup-folded 'content
        org-cycle-separator-lines 2
        org-return-follows-links t
        org-deadline-warning-days 30
        ;org-agenda-tags-column 75
        org-capture-bookmark nil)

  (setq org-agenda-start-with-log-mode t)
  (setq org-agenda-start-on-weekday 0)
  (setq org-agenda-weekend-days '(5 6))
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-todo-keywords
            '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
              (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAITING(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANCELLED(w@)")))

  (setq org-agenda-files '("~/.emacs.d/orgfiles/inbox.org"
                           "~/.emacs.d/orgfiles/projects.org"
                           "~/.emacs.d/orgfiles/repeaters.org"))

  (setq org-capture-templates '(("t" "TODO" entry
                                     (file+headline "~/.emacs.d/orgfiles/inbox.org" "Tasks")
                                     "* TODO %?\n  %i\n  %a")))
  (setq org-agenda-custom-commands
  '((" " "Agenda"
     ((agenda ""
              ((org-agenda-span 'week)))
      (todo "TODO"
             ((org-agenda-overriding-header "Unscheduled tasks")
              (org-agenda-files '("~/.emacs.d/orgfiles/inbox.org"))
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline))))
      (todo "TODO"
             ((org-agenda-overriding-header "Unscheduled project tasks")
              (org-agenda-files '("~/.emacs.d/orgfiles/projects.org"))
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline))))))))

  ;; Save all org buffers when a deadline/schedule/node/todo is changed.
  (defmacro func-ignore (fnc)
    "Return function that ignores its arguments and invokes FNC"
    '(lambda (&rest _rest)
       (funcall , fnc)))

  (advice-add 'org-deadline       :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-schedule       :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-store-log-note :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-todo           :after (func-ignore #'org-save-all-org-buffers)))

#+end_src

** Better Fonts and Bullets

*Packages:*
- [[https://github.com/sabof/org-bullets][sabof/org-bullets]]

#+begin_src emacs-lisp

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  ;(org-superstar-special-todo-items 'hide)
  (org-superstar-special-todo-items '(("TODO" . 9744)     ; ☐
                                      ("DONE" . 9745)))   ; ☑
  (org-superstar-item-bullet-alist '((42 . 10032)  ; -    ; ▸
                                     (43 . 8226)   ; +    ; •
                                     (45 . 9656))) ; *    ; ✰
  (org-superstar-headline-bullets-list '("◉" "○" "●" "✸" "✦" "▷" "✿")))

(with-eval-after-load 'org
  ;; Increase the size of various headings
  (set-face-attribute 'org-document-title nil :font "Cantarell" :weight 'bold :height 1.3 :foreground "#bfb3b6")

  (set-face-attribute 'org-level-1 nil :font "Cantarell" :weight 'medium :height 1.2 :foreground "#59c2ff")
  (set-face-attribute 'org-level-2 nil :font "Cantarell" :weight 'medium :height 1.1 :foreground "#d2a6ff")
  (set-face-attribute 'org-level-3 nil :font "Cantarell" :weight 'medium :height 1.05 :foreground "#ffb454")
  (set-face-attribute 'org-level-4 nil :font "Cantarell" :weight 'medium :height 1.0 :foreground "#f26d78")
  (set-face-attribute 'org-level-5 nil :font "Cantarell" :weight 'medium :height 1.1 :foreground "#aad94c")
  (set-face-attribute 'org-level-6 nil :font "Cantarell" :weight 'medium :height 1.1 :foreground "#e6b673")
  (set-face-attribute 'org-level-7 nil :font "Cantarell" :weight 'medium :height 1.1 :foreground "#95e6cb")
  (set-face-attribute 'org-level-8 nil :font "Cantarell" :weight 'medium :height 1.1 :foreground "#d95757")

  ;; Make sure org-indent face is available
  (require 'org-indent)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch)

  ;; Get rid of the background on column views
  (set-face-attribute 'org-column nil :background nil)
  (set-face-attribute 'org-column-title nil :background nil))

#+end_src

** Center Org Buffers

*Packages:*
- [[https://github.com/joostkremers/visual-fill-column][joostkremers/visual-fill-column]]

#+begin_src emacs-lisp

(defun malachi/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
 :hook (org-mode . malachi/org-mode-visual-fill))

#+end_src

** Auto-show Markup Symbols

*Packages:*
- [[https://github.com/awth13/org-appear][awth13/org-apear]]

#+begin_src emacs-lisp

(use-package org-appear
  :hook (org-mode . org-appear-mode))

#+end_src

** Org Roam

*Packages:*
- [[https://github.com/org-roam/org-roam][org-roam/org-roam]]

#+begin_src emacs-lisp

(use-package org-roam
  :custom
  (org-roam-directory "~/.emacs.d/orgfiles/roam")
  (org-roam-completions-everywhere t)
  (org-roam-capture-templates
    '(("d" "default" plain
       "%?"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
       :unnarrowed t)
      ("p" "project" plain
       "\n* Goals\n\n%?\n\n* Tasks\n\n++ TODO Add initial tasks\n\n* Dates\n\n"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+filetags: Project")
       :unnarrowed t)))
  :config
  (org-roam-setup))

#+end_src

** Exporting Org Files
