init.el

(use-package ivy-prescient ;; Remember history
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))

(use-package flx  ;; Improves sorting for fuzzy-matched results
  :after ivy
  :defer t
  :init
  (setq ivy-flx-limit 10000))

(use-package ivy-posframe
  :after ivy
  :custom
  (ivy-posframe-border-width 6)
  ;(ivy-posframe-width      200)
  (ivy-posframe-min-width  115)
  ;(ivy-posframe-height     10)
  (ivy-posframe-min-height 10)
  :config
  (setq ivy-posframe-display-functions-alist
        '((complete-symbol . ivy-posframe-display-at-point)
          (swiper . ivy-display-function-fallback)
          (swiper-isearch . ivy-display-function-fallback)
          (counsel-M-x . ivy-posframe-display-at-frame-top-center)
          (t . ivy-posframe-display-at-frame-top-center)))
  (setq ivy-posframe-parameters '((parent-frame . nil)
                                  (left-fringe . 8)
                                  (right-fringe . 8)))
  (ivy-posframe-mode t))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package page-break-lines
  :config
  (global-page-break-lines-mode))

(defun malachi/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil)
  (diminish org-indent-mode))

(use-package org
  :defer t
  :hook (org-mode . malachi/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-startup-folded 'content
        org-cycle-separator-lines 2
        org-return-follows-links t
        org-deadline-warning-days 30
        ;org-agenda-tags-column 75
        org-capture-bookmark nil)

  (setq org-agenda-start-with-log-mode t)
  (setq org-agenda-start-on-weekday 0)
  (setq org-agenda-weekend-days '(5 6))
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
  (setq org-todo-keywords
            '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
              (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAITING(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANCELLED(w@)")))

  (setq org-agenda-files '("~/.emacs.d/orgfiles/inbox.org"
                           "~/.emacs.d/orgfiles/projects.org"
                           "~/.emacs.d/orgfiles/repeaters.org"))

  (setq org-capture-templates '(("t" "TODO" entry
                                     (file+headline "~/.emacs.d/orgfiles/inbox.org" "Tasks")
                                     "* TODO %?\n  %i\n  %a")))
  (setq org-agenda-custom-commands
  '((" " "Agenda"
     ((agenda ""
              ((org-agenda-span 'week)))
      (todo "TODO"
             ((org-agenda-overriding-header "Unscheduled tasks")
              (org-agenda-files '("~/.emacs.d/orgfiles/inbox.org"))
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline))))
      (todo "TODO"
             ((org-agenda-overriding-header "Unscheduled project tasks")
              (org-agenda-files '("~/.emacs.d/orgfiles/projects.org"))
              (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline))))))))

  ;; Save all org buffers when a deadline/schedule/node/todo is changed.
  (defmacro func-ignore (fnc)
    "Return function that ignores its arguments and invokes FNC"
    '(lambda (&rest _rest)
       (funcall , fnc)))

  (advice-add 'org-deadline       :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-schedule       :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-store-log-note :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-todo           :after (func-ignore #'org-save-all-org-buffers)))

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-remove-leading-stars t)
  ;(org-superstar-special-todo-items 'hide)
  (org-superstar-special-todo-items '(("TODO" . 9744)     ; ☐
                                      ("DONE" . 9745)))   ; ☑
  (org-superstar-item-bullet-alist '((42 . 10032)  ; -    ; ▸
                                     (43 . 8226)   ; +    ; •
                                     (45 . 9656))) ; *    ; ✰
  (org-superstar-headline-bullets-list '("◉" "○" "●" "✸" "✦" "▷" "✿")))

(with-eval-after-load 'org
  ;; Set the size of various headings
  (set-face-attribute 'org-document-title nil :font "Cantarell" :weight 'bold :height 1.3)
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'medium :height (cdr face)))

  ;; Make sure org-indent face is available
  (require 'org-indent)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch)

  ;; Get rid of the background on column views
  (set-face-attribute 'org-column nil :background nil)
  (set-face-attribute 'org-column-title nil :background nil))
