config.org
*** LaTeX

#+begin_src emacs-lisp

(setq org-highlight-latex-and-related '(native))
(set-face-attribute 'org-latex-and-related nil :family "FiraCode NF" :weight 'normal :height 0.8 :foreground "#ff8f40")

(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
                 "\\documentclass{article}
                  [NO-DEFAULT-PACKAGES]
                  [PACKAGES]
                  [EXTRA]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

#+end_src

** Keybindings

*Packages:*
- [[https://github.com/Somelauw/evil-org-mode][Somelauw/evil-org-mode]]

#+begin_src emacs-lisp

(use-package evil-org
  :after org
  :hook ((org-mode . evil-org-mode)
         (org-agenda-mode . evil-org-mode)
  (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(malachi/leader-keys
  "o" '(:ignore t :which-key "org mode")
  "oi" '(:ignore t :which-key "insert")
  "oil" '(org-insert-link :which-key "insert link")
  "oa" '(org-agenda :which-key "agenda")
  "ot" '(org-todo-list :which-key "todos")
  "oc" '(org-capture t :which-key "capture")
  "ox" '(org-export-dispatch :which-key "export")
  "or" '(:ignore t :which-key "roam")
  "ort" '(org-roam-buffer-toggle t :which-key "toggle buffer")
  "orf" '(org-roam-node-find t :which-key "find")
  "ori" '(org-roam-node-insert t :which-key "insert")
  "orc" '(completion-at-point t :which-key "completion"))

#+end_src

** Configure Babel Languages

#+begin_src emacs-lisp

(with-eval-after-load 'org
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (lua . t)
      (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

#+end_src

** Block Templates

#+begin_src emacs-lisp

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
  (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
  (add-to-list 'org-structure-template-alist '("lua" . "src javascript"))
  (add-to-list 'org-structure-template-alist '("cpp" . "src c++"))
  (add-to-list 'org-structure-template-alist '("json" . "src json"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

** Auto-tangle Configuration Files

#+begin_src emacs-lisp

;; Automatically tangle our config.org config file when we save it
(defun malachi/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda ()
                        (add-hook 'after-save-hook #'malachi/org-babel-tangle-config)))

#+end_src

* Development
** Git
*** Magit

*Packages:*
- [[https://github.com/magit/magit][magit/magit]]
- [[https://github.com/alphapapa/magit-todos][alphapapa/magit-todos]]

#+begin_src emacs-lisp

(use-package magit
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(malachi/leader-keys
 "g" '(:ignore t :which-key "git")
 "gs" '(magit-status :which-key "status")
 "gd" '(magit-diff-unstaged :which-key "unstaged-diff")
 "gc" '(magit-branch-or-checkout :which-key "checkout")
 "gl" '(:ignore t :which-key "log")
 "glc" '(magit-log-current :which-key "current")
 "glf" '(magit-log-buffer-file :which-key "file")
 "gb" '(magit-branch :which-key "branch")
 "gP" '(magit-push-current :which-key "push")
 "gp" '(magit-pull-branch :which-key "pull")
 "gf" '(magit-fetch :which-key "fetch")
 "gF" '(magit-fetch-all :which-key "fetch all")
 "gr" '(magit-rebase :which-key "rebase"))

(use-package magit-todos
  :defer t)

#+end_src

*** Forge

*Packages:*
- [[https://github.com/magit/forge][magit/forge]]

#+begin_src emacs-lisp

(use-package forge
  :after magit)

#+end_src

*** Git Link

*Packages:*
- [[https://github.com/sshaw/git-link][sshaw/git-link]]

#+begin_src emacs-lisp

(use-package git-link
  :commands git-link
  :config
  (setq git-link-open-in-browser t)
  (malachi/leader-keys
    "gL"  '(git-link :which-key "link")))

#+end_src

*** Git Gutter

*Packages:*
- [[https://github.com/emacsorphanage/git-gutter][emacsorphanage/git-gutter]]
- [[https://github.com/emacsorphanage/git-gutter-fringe][emacsorphanage/git-gutter-fringe]]

#+begin_src emacs-lisp

(use-package git-gutter
  :diminish
  :hook ((prog-mode . git-gutter-mode)
         ;(org-mode . git-gutter-mode)
         (LaTeX-mode . git-gutter-mode)
         (text-mode . git-gutter-mode))
  :config
  (setq git-gutter:update-interval 2)
  (require 'git-gutter-fringe)
  (when (fboundp 'define-fringe-bitmap)
    (define-fringe-bitmap 'git-gutter-fr:added
      [224 224 224 224 224 224 224 224 224 224 224 224 224
           224 224 224 224 224 224 224 224 224 224 224 224]
      nil nil 'center)
    (define-fringe-bitmap 'git-gutter-fr:modified
      [224 224 224 224 224 224 224 224 224 224 224 224 224
           224 224 224 224 224 224 224 224 224 224 224 224]
      nil nil 'center)
    (define-fringe-bitmap 'git-gutter-fr:deleted
      [0 0 0 0 0 0 0 0 0 0 0 0 0 128 192 224 240 248]
      nil nil 'center)))

(use-package git-gutter-fringe
  :after git-gutter)

#+end_src

*** Git Time-machine

*Packages:*
- [[https://github.com/emacsmirror/git-timemachine][emacsmirror/git-time-machine]]

#+begin_src emacs-lisp

(use-package git-timemachine
  :commands (git-timemachine))
  :config
  (malachi/leader-keys
    "gt"  '(git-link :which-key "time-machine"))

#+end_src

** Projectile

_Dependencies:_
- [[https://github.com/BurntSushi/ripgrep][BurntSushi/ripgrep]] - for =counsel-projectile-rg=
- [[https://github.com/ggreer/the_silver_searcher][ggreerr/the_silver_searcher]] - for =counsel-projectile-ag=

example - Ubuntu:

#+begin_src shell

sudu apt-get install ripgrepp

sudu apt-get install silversearcher-ag

#+end_src

*Packages:*
- [[https://github.com/bbatsov/projectile][projectile]]
- [[https://github.com/ericdanan/counsel-projectile][ericdanan/counsel-projectile]]

#+begin_src emacs-lisp

(defun malachi/switch-project-action ()
  "Switch to a workspace with the project name and start `magit-status'."
  (persp-switch (projectile-project-name))
  (magit-status))

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :demand t
  :custom ((projectile-completion-system 'ivy))
  :init
  (when (file-directory-p "/mnt/c/Users/malach/My\ Stuff/Programming/My\ Projects")
    (setq projectile-project-search-path '("/mnt/c/Users/malach/My\ Stuff/Programming/My\ Projects")))
    (setq projectile-project-search-action #'projectile-dired)
    (setq projectile-switch-project-action #'malachi/switch-project-action))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(malachi/leader-keys
 "p" '(:ignore t :which-key "project")
 "pf" '(projectile-find-file :which-key "find file")
 "pF" '(consult-ripgrep :which-key "grep")
 "ps" '(projectile-switch-project :which-key "switch project")
 "pc" '(projectile-compile-project :which-key "compile project")
 "pd" '(projectile-dired :which-key "projectile-dired"))

#+end_src

** Languages
*** IDE Features with lsp-mode
**** lsp-mode

#+begin_src emacs-lisp

(defun malachi/lsp-mode-setup ()
  (setq lsp-headerline-breadcrum-segments '(path-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred);
  :init
  (setq lsp-clangd-binary-path "/usr/bin/clangd")
  (setq lsp-warn-no-matched-clients nil)
  ;(evil-define-key 'normal lsp-mode-map (kbd "SPC l") lsp-command-map)
  :hook (lsp-mode . malachi/lsp-mode-setup))
         ;(lsp-mode . lsp-enable-which-key-integration))

(add-hook 'prog-mode-hook #'lsp)

(malachi/leader-keys
 "l" '(:ignore t :which-key "lsp")
 "ld" '(xref-find-definitions :which-key "find definition")
 "lr" '(xref-find-references :which-key "find refrences")
 "ln" '(lsp-ui-find-next-reference :which-key "next reference")
 "lp" '(lsp-ui-find-prev-reference :which-key "previous reference")
 "lj" '(counsel-imenu :which-key "jump")
 "le" '(lsp-ui-flycheck-list :which-key "flycheck list")
 "ls" '(lsp-ui-sideline-mode :which-key "sideline mode")
 "lx" '(lsp-execute-code-action :which-key "execute action"))

#+end_src

**** lsp-ui

*Packages:*
- [[https://github.com/emacs-lsp/lsp-ui][emacs-lsp/lsp-ui]]

#+begin_src emacs-lisp

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-sideline-enable t)
  (setq lsp-ui-sideline-show-hover nil)
  (setq lsp-ui-doc-position 'bottom)
  (lsp-ui-doc-show))

#+end_src

**** lsp-ivy

*Packages:*
- [[https://github.com/emacs-lsp/lsp-ivy][emacs-lsp/lsp-ivy]]

#+begin_src emacs-lisp

(use-package lsp-ivy
    :after lsp)

#+end_src

