init.el

(use-package dap-mode
  :custom
  (lsp-enable-dap-auto-configure nil)
  :config
  (dap-ui-mode 1)
  (dap-tooltip-mode 1)
  :commands dap-debug
  :config
  ;; Set up Node debugging
  (require 'dap-node)
  (dap-node-setup) ;; Automatically installs Node debug adapter if needed

  ;; Set up cpp debugging
  ;; (require 'dap-lldb)

  ;; Bind `SPC l d` to `dap-hydra` for easy access
  (general-define-key
   :keymaps 'lsp-mode-map
   :prefix lsp-keymap-prefix
   "d" '(dap-hydra t :wk "debugger")))

(use-package flycheck
  :defer t
  :hook (lsp-mode . flycheck-mode))

(add-hook 'c-mode-hook 'lsp-deferred)
(add-hook 'c++-mode-hook 'lsp-deferred)

(use-package typescript-mode
  :mode ("\\.\\(ts\\|tsx\\)\\'")
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

(use-package json-mode
  :mode "\\.json\\'"
  :hook (before-save . malachi/json-mode-before-save-hook)
  :preface
  (defun malachi/json-mode-before-save-hook ()
    (when (eq major-mode 'json-mode)
      (json-pretty-print-buffer)))

  (defun malachi/json-array-of-numbers-on-one-line (encode array)
    "Print the arrays of numbers in one line"
    (let* ((json-encoding-pretty-print
            (and json-encoding-pretty-print
                 (not (loop for x across array always (numberp x)))))
           (json-encoding-separtor (if json-encoding-pretty-print "," ", ")))
           (funcall encode array)))
    :config (advice-add 'json-encode-array :around #'malachi/json-array-of-numbers-on-one-line))

(use-package python-mode
  :hook (python-mode . lsp-deferred)
  :custom
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  (python-shell-interpreter "python3")
  (dap-python-executable "python3")

  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))

(use-package pyvenv
  :after python-mode
  :config
  (pyvenv-mode 1))

(use-package lua-mode
  :mode "\\.lua\\'"
  :hook (lua-mode . lsp-deferred))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :init
  (setq company-clang-executable "/usr/lib/clang")
  :bind (:map company-active-map
        ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode)
  :config
  (setq company-box-icons-alist 'company-box-icons-all-the-icons
        company-box-backends-colors nil

        ;; These are the Doom Emacs defaults (icon colors)
        company-box-icons-all-the-icons
       `((Unknown . ,(all-the-icons-material "find_in_page" :face 'all-the-icons-purple))
        (Text . ,(all-the-icons-material "text_fields" :face 'all-the-icons-green))
        (Method . ,(all-the-icons-material "functions" :face 'all-the-icons-red))
        (Function . ,(all-the-icons-material "functions" :face 'all-the-icons-red))
        (Constructor . ,(all-the-icons-material "functions" :face 'all-the-icons-red))
        (Field . ,(all-the-icons-material "functions" :face 'all-the-icons-red))
        (Variable . ,(all-the-icons-material "adjust" :face 'all-the-icons-blue))
        (Class . ,(all-the-icons-material "class" :face 'all-the-icons-red))
        (Interface . ,(all-the-icons-material "settings_input_component" :face 'all-the-icons-red))
        (Module . ,(all-the-icons-material "view_module" :face 'all-the-icons-red))
        (Property . ,(all-the-icons-material "settings" :face 'all-the-icons-red))
        (Unit . ,(all-the-icons-material "straighten" :face 'all-the-icons-red))
        (Value . ,(all-the-icons-material "filter_1" :face 'all-the-icons-red))
        (Enum . ,(all-the-icons-material "plus_one" :face 'all-the-icons-red))
        (Keyword . ,(all-the-icons-material "filter_center_focus" :face 'all-the-icons-red))
        (Snippet . ,(all-the-icons-material "short_text" :face 'all-the-icons-red))
        (Color . ,(all-the-icons-material "color_lens" :face 'all-the-icons-red))
        (File . ,(all-the-icons-material "insert_drive_file" :face 'all-the-icons-red))
        (Reference . ,(all-the-icons-material "collections_bookmark" :face 'all-the-icons-red))
        (Folder . ,(all-the-icons-material "folder" :face 'all-the-icons-red))
        (EnumMember . ,(all-the-icons-material "people" :face 'all-the-icons-red))
        (Constant . ,(all-the-icons-material "pause_circle_filled" :face 'all-the-icons-red))
        (Struct . ,(all-the-icons-material "streetview" :face 'all-the-icons-red))
        (Event . ,(all-the-icons-material "event" :face 'all-the-icons-red))
        (Operator . ,(all-the-icons-material "control_point" :face 'all-the-icons-red))
        (TypeParameter ,(all-the-icons-material "class" :face 'all-the-icons-red))
        (Template . ,(all-the-icons-material "short_text" :face 'all-the-icons-green)))))

(use-package yasnippet-snippets)

(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-reload-all))

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

;;;; electric-pair
(use-package elec-pair
  :hook ((prog-mode org-mode) . electric-pair-mode)
  :config
  (setq electric-pair-preserve-balance t
        electric-pair-skip-whitespace nil
        electric-pair-delete-adjacent-pairs t
        electric-pair-open-newline-between-pairs nil
        electric-pair-skip-whitespace-chars '(9 10 32)
        electric-pair-skip-self 'electric-pair-default-skip-self)
  (setq electric-pair-pairs '( ; make electric-pair-mode work on more brackets.
                              (?\{ . ?\})
                              (?\[ . ?\])
                              ))) 

;; Disable electric-pair-mode in minibuffer during Macro definition
(defvar malachi/electic-pair-modes '(c-mode c++-mode lisp-mode emacs-lisp-mode org-mode))

(defvar malachi/electic-pair-modes '(c-mode c++-mode lisp-mode emacs-lisp-mode org-mode))

(defun malachi/inhibit-electric-pair-mode (char)
  (not (member major-mode malachi/electic-pair-modes)))

(setq electric-pair-inhibit-predicate #'malachi/inhibit-electric-pair-mode)

(add-hook 'org-mode-hook '+electric-inhibit-<)
(defun +electric-inhibit-< ()
  "Disable auto pairing of  `<>'."
  (setq-local electric-pair-inhibit-predicate
              `(lambda (c)
                 (if (char-equal c ?<) t
                   (,electric-pair-inhibit-predicate c)))))

(use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)))
