config.org
*** Auto-Indent

*Packages:*
- [[https://github.com/Malabarba/aggressive-indent-mode][Malabarba/aggressive-indent-mode]]

#+begin_src emacs-lisp

(use-package aggressive-indent
  :defer t
  ;; :hook ((prog-mode org-mode) . aggressive-indent-mode)
  :init (add-hook 'prog-mode-hook #'aggressive-indent-mode))
  ;; (add-to-list 'aggressive-indent-excluded-modes 'snippet-mode)
  (add-hook 'snippet-mode-hook (lambda () (aggressive-indent-mode -1)))

#+end_src

*** Highlight Indentation

*Packages:*
- [[https://github.com/DarthFennec/highlight-indent-guides][DarthFennec/highlight-indent-guides]]

#+begin_src emacs-lisp

(use-package highlight-indent-guides
  :custom
  (highlight-indent-guides-delay 0)
  (highlight-indent-guides-responsive 'stack)
  (highlight-indent-guides-method 'bitmap)
  (highlight-indent-guides-auto-enabled t)
  (highlight-indent-guides-bitmap-function 'highlight-indent-guides--bitmap-line 2 10)
  ;(highlight-indent-guides-character ?\|) ;; Indent character samples: | ┆ ┊
  :commands highlight-indent-guides-mode
  :hook (prog-mode  . highlight-indent-guides-mode))

#+end_src

** Folding

*Packages:*
- [[https://github.com/gregsexton/origami.el][gregsexton/origami.el]]

#+begin_src emacs-lisp

(use-package origami
  :hook ((yaml-mode . origami-mode)
         (c-mode . origami-mode)
         (c++-mode . origami-mode)
         (javascript-mode . origami-mode)
         (typescript-mode . origami-mode)
         (elisp-mode . origami-mode)
         (python-mode . origami-mode)
         (LaTeX-mode . origami-mode)))
  
#+end_src

** Rainbow Delimiters

*Packages:*
- [[https://github.com/Fanael/rainbow-delimiters][Fanael/rainbow-delimiters]]

#+begin_src emacs-lisp

(use-package rainbow-delimiters
  :hook ((prog-mode LaTex-mode) . rainbow-delimiters-mode))

#+end_src

** Rainbow Mode

#+begin_src emacs-lisp

(use-package rainbow-mode
  :defer t
  :hook ((prog-mode . rainbow-mode)
         (web-mode . rainbow-mode)
         (css-mode . rainbow-mode)))

#+end_src

** Tree-sitter

*Packages:*
- [[https://github.com/emacs-tree-sitter/tree-sitter-langs][emacs-tree-sitter/tree-sitter-langs]]
- [[https://github.com/emacs-tree-sitter/elisp-tree-sitter][emacs-tree-sitter/elisp-tree-sitter]]

#+begin_src emacs-lisp

(use-package tree-sitter-langs)

(use-package tree-sitter
  :after tree-sitter-langs
  :hook (global-tree-sitter-mode . tree-sitter-hl-mode)
  :custom
  ((global-tree-sitter-mode t))
  :config
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

#+end_src

** Volatile-Highlights

*Packages:*
- [[https://github.com/k-talo/volatile-highlights.el][k-talo/volitile-highlights.el]]

#+begin_src emacs-lisp

(use-package volatile-highlights
  :commands volatile-highlights-mode
  :hook (after-init . volatile-highlights-mode)
  :config
  ;; Supporting evil-mode.
  (vhl/define-extension 'evil 'evil-paste-after 'evil-paste-before 'evil-paste-pop 'evil-move)
  (vhl/install-extension 'evil)
  ;; Supporting undo-tree.
  (vhl/define-extension 'undo-tree 'undo-tree-yank 'undo-tree-move)
  (vhl/install-extension 'undo-tree))

#+end_src

* Writing
** Focus Mode

*Packages:*
- [[https://github.com/joaotavora/darkroom][joaotavora/darkroom]]

#+begin_src emacs-lisp

  (use-package darkroom
    :commands darkroom-mode
    :config
    (setq darkroom-text-scale-increase 0)
    (darkroom-tentative-mode 0))

  (defun malachi/enter-focus-mode ()
    (interactive)
    (darkroom-tentative-mode 1)
    (centaur-tabs-mode 0)
    (display-line-numbers-mode 0))

  (defun malachi/leave-focus-mode ()
    (interactive)
    (darkroom-tentative-mode 0)
    (centaur-tabs-mode 1)

    (if (eq major-mode 'org-mode)
        (display-line-numbers-mode 0)
      (display-line-numbers-mode 1)))

  (defun malachi/toggle-focus-mode ()
    (interactive)
    (if (symbol-value darkroom-tentative-mode)
        (malachi/leave-focus-mode)
      (malachi/enter-focus-mode)))

  (malachi/leader-keys
    "tf" '(malachi/toggle-focus-mode :which-key "focus mode"))

#+end_src
** TODO PDF Tools

Must run =M-x pdf-tools-install= after installation of =pdftools=.

*Packages:*
- [[https://github.com/vedang/pdf-tools][vedang/pdf-tools]]

#+begin_src emacs-lisp

(use-package pdf-tools
  :defer t)

#+end_src

* Terminals
** term-mode

#+begin_src emacs-lisp

(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "bash")
  (setq term-prompt-regex "^[#$%>\n]*[#$%>] *"))

#+end_src

***  Better Color Support

[[https://github.com/dieggsy/eterm-256color][dieggsy/eterm-256color]]

Make sure the =tic= program iis  available on your machine (could be part of =ncurses= package)

#+begin_src emacs-lisp

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

#+end_src

*** ansi-term

=ansi-term= is a specialization of =term-mode=

Minor differences:
- C-x is prefix key instead of C-c
- Buffers are managed slightly differently

Same caveats for Windows still apply.

** vterm

*Packages:*
- [[https://github.com/akermu/emacs-libvterm][akermu/emacs-libvterm]]

NOTE: This one needs to compile a native library, make sure to install its dependencies!

_Differences to =term=:_
- Written in native code, much faster and better emulation
- There is no =line-mode= / =char-mode= split

#+begin_src emacs-lisp

(use-package vterm
  :after evil-collection
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (setq vterm-max-scrollback 10000)
  (addvice-add 'evil-collection-vterm-insert :before #'vterm-reset-cursor-point))

#+end_src

** Eshell

_Pros:_
- Replicates Bash with cross-platform elisp functions
- Consistent shell experience across all OSes
- You can run Emacs commands and arbitrary Emacs Lisp in the shell
- You can pipe output of commands directly into an Emacs buffer
- Supports TRAMP

_Cons:_
- Completions are not great out of the box compared to Bash
- Eshell commands can be very slow compared to the real programs
- Piping is much less functional than in "real" shells
- Subshell syntax is a bit different - =${}= instead of =$()=
- Programs that read input (like language REPLs) can operate strangely
- Tools that depend on setting shell environment (nvm, virtualenv, etc) don't work
- Can be a little slow on Windows

*Packages:*
- [[https://github.com/xuchunyang/eshell-git-prompt][xuchunyang/eshell-git-prompt]]
- [[https://github.com/dieggsy/esh-autosuggest][dieggsy/esh-autosuggest]]
- [[https://github.com/akreisher/eshell-syntax-highlighting][akreisher/eshell-syntax-highlighting]]

- =counsel-eshell-history= - A searchable history of commands typed into the shell

#+begin_src emacs-lisp

(defun malachi/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for preformance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  ;(evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

 (setq eshell-history-size 10000
       eshell-buffer-maximum-lines 10000
       eshell-hist-ignoreedups t
       eshell-scroll-to-bottom-on-input t))

(use-package esh-autosuggest
  :after eshell
  :hook (eshell-mode . esh-autosuggest-mode)
  :config
  (setq esh-autosuggest-delay 0.5))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

(use-package eshell
  :hook (eshell-first-time-mode . malachi/configure-eshell))
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "vim"))

    (eshell-git-prompt-use-theme 'powerline))

#+end_src

* File Managment
