init.el

(use-package aggressive-indent
  :defer t
  ;; :hook ((prog-mode org-mode) . aggressive-indent-mode)
  :init (add-hook 'prog-mode-hook #'aggressive-indent-mode))
  ;; (add-to-list 'aggressive-indent-excluded-modes 'snippet-mode)
  (add-hook 'snippet-mode-hook (lambda () (aggressive-indent-mode -1)))

(use-package highlight-indent-guides
  :custom
  (highlight-indent-guides-delay 0)
  (highlight-indent-guides-responsive 'stack)
  (highlight-indent-guides-method 'bitmap)
  (highlight-indent-guides-auto-enabled t)
  (highlight-indent-guides-bitmap-function 'highlight-indent-guides--bitmap-line 2 10)
  ;(highlight-indent-guides-character ?\|) ;; Indent character samples: | ┆ ┊
  :commands highlight-indent-guides-mode
  :hook (prog-mode  . highlight-indent-guides-mode))

(use-package origami
  :hook ((yaml-mode . origami-mode)
         (c-mode . origami-mode)
         (c++-mode . origami-mode)
         (javascript-mode . origami-mode)
         (typescript-mode . origami-mode)
         (elisp-mode . origami-mode)
         (python-mode . origami-mode)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :defer t
  :hook ((prog-mode . rainbow-mode)
         (web-mode . rainbow-mode)
         (css-mode . rainbow-mode)))

(use-package tree-sitter-langs)

(use-package tree-sitter
  :after tree-sitter-langs
  :hook (global-tree-sitter-mode . tree-sitter-hl-mode)
  :custom
  ((global-tree-sitter-mode t))
  :config
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package volatile-highlights
  :commands volatile-highlights-mode
  :hook (after-init . volatile-highlights-mode)
  :config
  ;; Supporting evil-mode.
  (vhl/define-extension 'evil 'evil-paste-after 'evil-paste-before 'evil-paste-pop 'evil-move)
  (vhl/install-extension 'evil)
  ;; Supporting undo-tree.
  (vhl/define-extension 'undo-tree 'undo-tree-yank 'undo-tree-move)
  (vhl/install-extension 'undo-tree))

(use-package darkroom
  :commands darkroom-mode
  :config
  (setq darkroom-text-scale-increase 0)
  (darkroom-mode 0))

(defun malachi/enter-focus-mode ()
  (interactive)
  (darkroom-mode 1)
  (display-line-numbers-mode 0))

(defun malachi/leave-focus-mode ()
  (interactive)
  (darkroom-mode 0)
  (display-line-numbers-mode 1))

(defun malachi/toggle-focus-mode ()
  (interactive)
  (if (symbol-value darkroom-mode)
    (malachi/leave-focus-mode)
    (malachi/enter-focus-mode)))

(malachi/leader-keys
  "tf" '(malachi/toggle-focus-mode :which-key "focus mode"))

(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "bash")
  (setq term-prompt-regex "^[#$%>\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
  :after evil-collection
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (setq vterm-max-scrollback 10000)
  (addvice-add 'evil-collection-vterm-insert :before #'vterm-reset-cursor-point))

(defun malachi/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for preformance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  ;(evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

 (setq eshell-history-size 10000
       eshell-buffer-maximum-lines 10000
       eshell-hist-ignoreedups t
       eshell-scroll-to-bottom-on-input t))

(use-package esh-autosuggest
  :after eshell
  :hook (eshell-mode . esh-autosuggest-mode)
  :config
  (setq esh-autosuggest-delay 0.5))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

(use-package eshell
  :hook (eshell-first-time-mode . malachi/configure-eshell))
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "vim"))

    (eshell-git-prompt-use-theme 'powerline))
